Revit 2024 API
FormulaManager Class
 A class to access and query information about formula engine in Revit models.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class FormulaManager : IDisposable
Visual Basic
Public Class FormulaManager _
	Implements IDisposable
Visual C++
public ref class FormulaManager : IDisposable
Remarks
 Formula manager
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FormulaManager
See Also
FormulaManager Members
Autodesk.Revit.DB Namespace